In [1]:
import numpy as np
import pandas as pd
import re
#columns - customer_id ,  name,  age, gender

In [2]:
og_df = pd.read_csv("Car_sales_dataset_raw.csv")
og_df.sample(10)

,Date,Salesperson,Customer Name,Customer Age,Customer Gender,Car Make,Car Model,Car Year,Quantity,Sale Price,...,Discount,Payment Method,Commission Rate,Commission Earned,Sales Region,Sale Year,Sale Month,Sale Quarter,Day of Week,Season
485160,2020-12-08,Sharon Smith,Susan Sanchez,70,Male,Nissan,Altima,2024,3,103390.56,...,0.08,Loan,0.06,6203.43,Maryland,2022,December,4,Tuesday,Winter
873930,2022-07-24,Dr. Diane Mccoy,Rachel Wade,46,Female,Nissan,Rogue,2023,3,86480.94,...,0.06,Loan,0.08,6918.48,New Mexico,2024,July,3,Sunday,Summer
449306,2020-07-09,Kevin Chavez,Lori Lindsey,24,Male,Chevrolet,Equinox,2024,2,93061.88,...,0.05,Cash,0.09,8375.57,Missouri,2024,July,3,Thursday,Summer
314054,2021-01-08,Jennifer Miller,Albert Dennis Jr.,31,Female,Mercedes,E-Class,2021,3,207523.68,...,0.07,Lease,0.09,18677.13,Louisiana,2024,January,1,Friday,Winter
735208,2023-10-09,Jennifer Miller,Laura Cole,48,Male,Mercedes,S-Class,2020,3,219036.09,...,0.03,Lease,0.09,19713.25,Arkansas,2024,October,4,Monday,Fall
129883,2024-07-08,Chad Turner,Kathleen Oliver,61,Male,Toyota,Prius,2021,2,53752.96,...,0.14,Cash,0.06,3225.18,Oklahoma,2023,July,3,Monday,Summer
883460,2021-06-20,Amy Peterson,Noah Duarte,66,Male,Ford,Explorer,2019,3,135934.89,...,0.13,Loan,0.08,10874.79,Louisiana,2023,June,2,Sunday,Summer
841798,2022-04-12,Rose Le,Sabrina Gray,70,Male,Honda,Pilot,2019,2,77572.56,...,0.05,Lease,0.12,9308.71,Massachusetts,2024,April,2,Tuesday,Spring
974309,2018-01-21,Cheryl Flores,Jennifer Garcia,66,Male,Honda,Accord,2019,2,49705.32,...,0.09,Cash,0.08,0.00,Massachusetts,2023,January,1,Sunday,Winter
751649,2019-08-07,Kevin Chavez,Megan Cooper,33,Female,Nissan,Pathfinder,2019,2,67023.88,...,0.01,Lease,0.09,6032.15,North Dakota,2023,August,3,Wednesday,Summer

In [3]:
og_df['Customer Name'] = og_df['Customer Name'].str.replace(r'^(Mr\.|Mrs\.|Ms\.|Dr\.)\s+', '', regex=True)
og_df['Customer Name'] = og_df['Customer Name'].str.replace(
    r'[, ]*\b(?:M\.?D\.?|D\.?D\.?S\.?|D\.?V\.?M\.?|P(?:H|\.H\.?)\.?D\.?)\b[, ]*$',
    '',
    regex=True,
    flags=re.IGNORECASE
).str.strip()
og_df['Customer Name']

#Removes unwanted prefix and suffix #DVM PHD

0           Kristin Blackwell
1                 Diana Black
2                Craig Powers
3               Jade Williams
4          Nicholas Fernandez
                  ...
1000663        Maurice Robles
1000664         Brian Mullins
1000665          Sarah Wilson
1000666       Timothy Mcguire
1000667           Kevin Mason
Name: Customer Name, Length: 1000668, dtype: object

In [4]:
ww = og_df.drop_duplicates(subset = ['Customer Name'])
uc = ww['Customer Name']
ua = ww['Customer Age']
ug = ww['Customer Gender']
ww[['Customer Name', 'Customer Age', 'Customer Gender']]

              Customer Name  Customer Age Customer Gender
0         Kristin Blackwell            42            Male
1               Diana Black            65          Female
2              Craig Powers            67          Female
3             Jade Williams            69          Female
4        Nicholas Fernandez            50            Male
...                     ...           ...             ...
1000627      Melanie Austin            37          Female
1000633       Lynn Alvarado            26          Female
1000636      Corey Townsend            40          Female
1000657            Chase Le            22            Male
1000663      Maurice Robles            67          Female

[301586 rows x 3 columns]

In [ ]:
uc = ww['Customer Name'].unique()

c_a = pd.DataFrame({'Customer Name': uc, 'Customer Age': ua, 'Customer Gender':ug})
c_a

#After removing the prefix and suffix, almost 32000 duplicate rows were reduced

              Customer Name  Customer Age Customer Gender
0         Kristin Blackwell            42            Male
1               Diana Black            65          Female
2              Craig Powers            67          Female
3             Jade Williams            69          Female
4        Nicholas Fernandez            50            Male
...                     ...           ...             ...
1000627      Melanie Austin            37          Female
1000633       Lynn Alvarado            26          Female
1000636      Corey Townsend            40          Female
1000657            Chase Le            22            Male
1000663      Maurice Robles            67          Female

[301586 rows x 3 columns]

In [ ]:
c_a['Customer_id'] = ['cus' + str(i).zfill(6) for i in range(1, len(c_a)+1)]

# Display the result
print(c_a.head())

        Customer Name  Customer Age Customer Gender Customer_id
0   Kristin Blackwell            42            Male   cus000001
1         Diana Black            65          Female   cus000002
2        Craig Powers            67          Female   cus000003
3       Jade Williams            69          Female   cus000004
4  Nicholas Fernandez            50            Male   cus000005

In [23]:
temp = c_a.pop('Customer_id')
c_a.insert(0,'Customer_id', temp)
c_a

        Customer_id       Customer Name  Customer Age Customer Gender
0         cus000001   Kristin Blackwell            42            Male
1         cus000002         Diana Black            65          Female
2         cus000003        Craig Powers            67          Female
3         cus000004       Jade Williams            69          Female
4         cus000005  Nicholas Fernandez            50            Male
...             ...                 ...           ...             ...
1000627   cus301582      Melanie Austin            37          Female
1000633   cus301583       Lynn Alvarado            26          Female
1000636   cus301584      Corey Townsend            40          Female
1000657   cus301585            Chase Le            22            Male
1000663   cus301586      Maurice Robles            67          Female

[301586 rows x 4 columns]

In [24]:
c_a.to_csv('Customer_table.csv', index= False)